# 딕셔너리(Dictionary)
# 사전 형태의 자료형


#딕셔너리 선언
stock_a = {"삼성전자" : 82000, "LG전자" : 150000}

stock_b = {
    "삼성전자" : [81000, 81500, 82000, 81500, 82000],
    "LG전자" : (150000, 149000, 148000, 151000, 152000)
}

#중첩 딕셔너리
stock_c = {
    "삼성전자" : {
        "현재가" : 82000,
        "보유수량" : 5,
        "매수단가" : 81000
    }
}

#딕셔너리 출력
#print(stock_a)
#print(stock_b)
#print(stock_c)


#딕셔너리 접근하기
print(stock_a["삼성전자"]) #82000

#중첩딕셔너리 접근하기
print(stock_c["삼성전자"]["보유수량"]) #5

#딕셔너리 할당하기
stock_a["삼성전자"] = 85000 # 82000 --> 85000

#딕셔너리 삭제하기
del stock_a["LG전자"] # {'삼성전자': 82000, 'LG전자': 150000} --> {'삼성전자': 82000}

#딕셔너리 함수
stock_d = {
    "삼성전자" : 82000,
    "SK하이닉스" : 123000,
    "NAVER" : 370000,
    "카카오" : 133000
}

#1) 키와 데이터 쌍 반환
print(stock_d.items()) # --> dict_items([('삼성전자', 82000), ('SK하이닉스', 123000), ('NAVER', 370000), ('카카오', 133000)])

for item in stock_d.items():
    print(item) # 튜플 형대로 출력이 된다. 키만 출력하고 싶을 땐 item[0] 이런 형식으로 인덱스에 0을 작성

#2) 키값만 반환
for key in stock_d.keys():
    print(key)

#3) 데이터만 반환
for value in stock_d.values():
    print(value)