""""
★★★★★클래스와 객체의 개념(중요!)★★★★★

클래스 정의
: 객체를 만들기 위한 설계도

객체
: 객체(object, instance)란 서로 연관된 데이터와 그 데이터를
조작하기 위한 함수를 하나의 집합으로 모아놓은 것을 말한다.

붕어빵으로 예를 들면 클래스는 붕어빵을 만들기 위한 붕어빵 틀
틀에서 만들어진 붕어빵이 객체

클래스를 사용해야 하는 이유
하나의 클래스로 무한정 객체를 복사할 수 있기 때문에 훨씬 효율적인 프로그래밍이 가능하다.


클래스 선언 하는법
class 클래스이름:
    def 메서드 이름(self):
        명령블록

ex)
class Monster:
    def say(self):
        print("나는 몬스터다")

클래스 호출 하는법
인스턴스 = 클래스이름() --> 인스턴스 = 객체
인스턴스.메서드

ex)
goblin = Monster()
goblin.say()


클래스 변수
: 인스턴스들이 모두 공유하는 변수


"""

