# 튜플
# : 읽기 전용 리스트


# 튜플 선언
a = (3,4,5)
b = 3,4,5

c = (3,)
d = 3,


#튜플 함수를 이용해 리스트를 튜플로 변환
e = tuple([3,4,5])

#리스트를 튜플로 변경
f = list(range(10)) #반복문을 통해 리스트에 요소 집어 넣기 --> [0, 1, 2, 3, 4, 5, 6, 7, 8, 9]
g = tuple(f) #리스트 값을 튜플 함수를 이용해 튜플로 변환 --> (0, 1, 2, 3, 4, 5, 6, 7, 8, 9)

#튜플을 리스트로 변환 하여 저장
h = 3,4,5
i = list(h)


#튜플 관련 함수
x = 5, 6, 7, 8


#1) 최댓값
print(max(x)) # --> 8

#2) 최솟값
print(min(x)) # --> 5

#3) 요소들의 합
print(sum(x))

#4) 요소들의 개수
print(x.count(6)) # 튜플에 들어가 있는 요소 중 6이 몇개가 들어가 있는지 확인

#5) 인덱스 번호 반환
print(x.index(7)) # 7이 소속 되어 있는 인덱스 값을 반환

