"""
패스트게임즈에 인턴으로 근무하게 된 종현. 사수에게 과제로 게임 메뉴 만들기를 받았다.
과제 내용은 다음과 같았다.

-과제-
숫자 1 입력 : "게임을 시작합니다" 출력
숫자 2 입력 : "실시간 랭킹" 출력
숫자 3 입력 : "게임을 종료합니다" 출력 후 프로그램 종료
"""



while True:
    print("메뉴를 선택하세요.")
    print("1. 게임시작")
    print("2. 실시간 랭킹")
    print("3. 게임 종료")

    x = int(input("메뉴 입력 : "))

    if x < 0 or x > 3:
        print("다시입력해주세요.")
        continue

    if x == 1:
        print("■■■■■■■■■■■")
        print("■ 게임시작 ■")
        print("■■■■■■■■■■■")
        print(" ")
        print(" ")
    elif x == 2:
        print("■■■■■■■■■■■■")
        print("■ 실시간랭킹 ■")
        print("■■■■■■■■■■■■")
        print(" ")
        print(" ")
    elif x ==3:
        print("게임 종료")
        break



